# Список тварин
animals = ["camel", "lion", "deer", "goose", "bat", "rabbit"]
animals[0]=r"""
    The camel habitat... 
    ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⠉⢉⠛⠿⣿⠿⠛⠛⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣆⠙⠳⢦⡀⠄⠄⠄⠄⠙⠿⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣿⣶⣦⠄⠄⠄⠄⠄⢀⣀⣀⡀⠈⠛⠛⠛⠛⠛⠻⣿⣿⣿⣿
⣿⣿⣿⣿⠁⠄⠄⠄⠄⠈⠉⠉⠄⠄⠄⠄⠄⠄⠄⢦⡈⢿⣿⣿
⣿⣿⣿⡇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠃⠈⠻⣿
⣿⣿⣿⣇⠄⠄⠸⣄⣀⣀⣀⣠⣄⠄⠄⠄⠐⠲⠦⣤⣤⣄⣠⣿
⣿⣿⣿⣿⡀⠄⠄⠈⠉⠉⠉⣽⣿⣿⣶⣦⣄⣀⠄⠄⠄⠉⣿⣿
⣿⣿⣿⣿⠃⠄⠄⠄⠄⠄⢰⣿⣿⣿⣿⣿⣿⣿⣦⣤⣤⣴⣿⣿
⣿⠿⠛⠁⠄⠄⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
⣿⣤⣤⣤⣤⣤⣤⣤⣤⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
Look at that!"""
animals[1]=r"""
The lion habitat...
⠄⠄⠄⠄⠄⠄⢀⣴⣦⣼⣦⣤⡴⢀⣆⣠⣄
⠄⠄⠄⠄⣴⣶⣼⣿⣿⣿⣿⣿⣷⣿⣿⣿⣿⣷⡷⡆
⠄⠄⠄⠄⣵⣎⣿⣿⡏⠉⠈⢻⠟⠁⠉⠙⢿⣯⣾⠆
⠄⠄⠄⣼⣿⣿⣿⢥⣤⣤⡀⠄⠄⢀⣤⣤⢼⣿⣿⡄
⠄⠄⢀⣿⣿⣿⣇⣀⣠⣼⡇⠄⠄⠈⠄⠄⣀⣿⣿⣿⣦
⠄⠄⣼⣿⣿⣿⣿⣿⣿⠛⢷⣶⣶⠆⠄⣾⣿⣿⣿⣿⡿⠆
⢠⣾⣿⣿⣿⣿⣿⣿⡇⠄⢀⣸⣁⠄⠄⢸⣿⣿⣿⣿⣿⡄
⠄⢀⣿⣿⣿⣿⣿⣿⣿⡟⠋⠉⠉⠙⢾⣿⣿⣿⣿⣿⣿⣿⡄
⠄⣿⣿⣿⣿⣿⣿⣿⣿⣦⣀⢰⡄⣀⣿⣿⣿⣿⣿⣿⣿⣿⠿⠆
⢰⣿⢟⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⣿
⠈⠃⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠹
⠄⠄⣿⣿⠋⢿⣿⣿⣿⡿⢋⣿⣿⡿⢸⣿⣿⣿⠟⠁
⠄⠄⢹⡏⠄⠘⢿⣿⠋⠄⢸⣿⡿⠁⣾⣿⠋⠁
⠄⠄⠘⠄⠄⠄⠄⠈⠄⠄⠄⠿⠄⠄⠹⠃
Look at that!"""
animals[2]=r"""
The deer habitat...
︵┈┈┈┈┈┈┈┈┈┈┈┈┈︵
▏▏┈┈┈┈┈┈┈┈┈┈┈▕▕
▏╭╮┈┈┈┈┈┈┈┈┈╭╮▕
╲／／┈╭╮┈┈┈╭╮┈＼＼╱
┈╲▂▔┈／┈┈┈＼┈▔▂╱
━▂┈▔＼＼╮╭╭／／▔┈▂━
╲┈▔╲╱▔╲╮╱▔╲╱▔┈╱
┈╲▂╱／▔＼┈／▔＼╲▂╱
┈┈┈▏＼▂▉┈▉▂／▕
┈┈┈╲┈┈╱▔╲┈┈╱
┈┈┈┈▏▕╮┈╭▏▕
┈┈┈┈╲┈╲▂╱┈╱
┈┈┈┈┈╲▂人▂╱
┈┈┈┈┈┈＼▂／

Look at that!"""
animals[3]=r"""
The goose habitat...
░░░░░░░░░░░░░░░░░░░░░▄▄▄░░░░
░░░░░░░░░░░░░░░░░░░▄█████▄░░
░░░░░░░░░░░░░░░░░░░████████▄
░░░░░░░░░░░░░░░░░░░███░░░░░░
░░░░░░░░░░░░░░░░░░░███░░░░░░
░░░░░░░░░░░░░░░░░░░███░░░░░░
░░░░░░░░░░░░░░░░░░░███░░░░░░
░░░░░░░░░░░░░░░░░░░███░░░░░░
░░░░░░░░░░░░░▄▄▄▄▄████░░░░░░
░░░░░░░░▄▄████████████▄░░░░░
░░░░▄▄██████████████████░░░░
▄▄██████████████████████░░░░
░▀▀████████████████████▀░░░░
░░░░▀█████████████████▀░░░░░
░░░░░░▀▀███████████▀▀░░░░░░░
░░░░░░░░░▀███▀▀██▀░░░░░░░░░░
░░░░░░░░░░█░░░░██░░░░░░░░░░░
░░░░░░░░░░█░░░░█░░░░░░░░░░░░
░░░▄▄▄▄███████▄███████▄▄▄▄░░
Look at that!"""
animals[4]=r"""
The bat habitat...
┈┈┈┈┈▕╲▂▂╱▏┈┈┈┈┈
┈┈╱╲┈▕▅╮▅╮▏┈╱╲┈┈
┈╱╱▏╲▕━╯━╯▏╱▕╲╲┈
╱╱┈▏┈╲▏╰╯▕╱┈▕┈╲╲
▏┈┈▏┈┈▏┈┈▕┈┈▕┈┈▕
▏┈┈▏┈┈▏┈┈▕┈┈▕┈┈▕
╲╱▔╲╱▔╲┈┈╱▔╲╱▔╲╱
┊┊┊┊┊┊┊╲╱┊┊┊┊┊┊┊
Look at that!"""
animals[5]=r"""
The rabbit habitat...
┈╱▔▔▔╲▕╱╱╱▔▔▔╲┈┈
╱╭╱▔╲╮▔┈▔╭╱▔╲╮╲┈
▏┊▏┈▕╭╮┈╭╮▏┈▕┊▕┈
▏┊▏┈╱┃┃┈┃┃╲┈▕┊▕┈
▏┊▏╱┈┃▋┈┃▋┈╲▕┊▕┈
╲╱▕▔▔▔╲▃╱▔▔▔▏╲╱┈
┈┈┈╲┈╰┳┳┳╯┈╱┈┈┈┈
┈┈┈┈▔▔┗━┛▔▔┈┈┈┈┈
Look at that!"""

while True:
    # Виведення тварин за номером
    print("Please enter the number of the habitat you would like to view (or type 'exit' to quit):")
    user_input = input()

    if user_input == "exit":
        print("See you later!")
        break

    try:
        number = int(user_input)
        if 0 <= number < len(animals):
            selected_animal = animals[number]
            print(f"You've selected the {selected_animal}.")
        else:
            print("Invalid input. Please enter a valid number.")
    except ValueError:
        print("Invalid input. Please enter a valid number or 'exit'.")

# Використовуємо список для доступу до тварини
selected_animal = animals[number] if 0 <= number < len(animals) else None
if selected_animal:
    print(f"You've selected the {selected_animal}.")
else:
    print("Invalid input. Please enter a valid number.")
print("You've reached the end of the program.")


